import os
os.environ['KMP_DUPLICATE_LIB_OK'] = 'True'

import torch
import torchvision


""" 
# 区域卷积神经网络（R-CNN），包括以下四个步骤：
# 1.对输入图像使用选择性搜索选取多个高质量提议区域(通常多尺度下选取，
# 并且具有不同的形状和大小。每个提议区域都将被标注类别和真实边界框)；
# 2.选择预训练卷积神经网络，并将其在输出层之前截断。将每个提议区域
# 变形为网络需要的输入尺寸，并通过前向传播输出抽取的提议区域特征；
# 3.将每个提议区域的特征连同其标注的类别作为一个样本。训练多个支持向
# 量机对目标分类，其中每个支持向量机用来判断样本是否属于某一个类别；
# 4.将每个提议区域特征连同标注边界框作为样本，训练线性回归模型来预测真实边界框
# R‐CNN的主要性能瓶颈在于，对每个提议区域，卷积神经网络的前向传播是独立的，
# 而没有共享计算。由于这些区域通常有重叠，独立的特征抽取会导致重复的计算。

# Fast R-CNN的主要改进之一，是仅在整张图象上执行卷积神经网络的前向传播
# 1.Fast R‐CNN用来提取特征的卷积神经网络的输入是整个图像，而不是各个提议区域。此外，
# 这个网络通常会参与训练。设输入为图像，将卷积神经网络的输出的形状记为1 × c × h1 × w1；
# 2.假设选择性搜索生成n个提议区域。这些形状各异提议区域在卷积神经网络的输出上分别标出形
# 状各异的兴趣区域。然后，这些感兴趣的区域需要进一步抽取出形状相同特征，以便于连结后输出；
# 为实现目标，Fast R‐CNN引入兴趣区域汇聚层(兴趣区域汇聚层对每个区域输出形状可直接指定)：
# 将卷积神经网络输出和提议区域作为输入，输出连结后各个提议区域抽取特征，形状n×c×h2×w2；
# 3.通过全连接层将输出形状变为n × d，其中超参数d取决于模型设计；
# 4.预测n个提议区域中每个区域的类别和边界框。
X = torch.arange(16.).reshape(1, 1, 4, 4)
rois = torch.Tensor([[0, 0, 0, 20, 20], [0, 0, 10, 30, 30]])

# Faster R-CNN提出将选择性搜索替换为区域提议网络，减少提议区域生成数量，保证目标检测精度
# 1.使用填充为1的3 × 3的卷积层变换卷积神经网络输出，将输出通道数记为c。这样，卷积神经网络
# 为图像抽取的特征图中的每个单元均得到一个长度为c的新特征
# 2.以特征图的每个像素为中心，生成多个不同大小和宽高比的锚框并标注它们
# 3.使用锚框中心单元长度为c的特征，分别预测该锚框的二元类别（含目标还是背景）和边界框
# 4.使用非极大值抑制，从预测类别为目标的预测边界框中移除相似结果。最终输出预测边界框即是兴趣区域汇聚层所需的提议区域
# 区域提议网络能够学习到如何生成高质量的提议区域，从而在减少从数据中学习的提议区域的数量的情况下，仍保持目标检测的精度

# 如果在训练集中还标注每个目标在图像上的像素级位置，Mask R-CNN能够有效利用标注信息进一步提升目标检测的精度
# Mask R‐CNN将兴趣区域汇聚层换为兴趣区域对齐层，使用双线性插值保留特征图上的空间信息，从而更适于像素级预测
# 兴趣区域对齐层输出包含所有与兴趣区域形状相同的特征图，不仅用于预测每个兴趣区域类别和边界框，还通过额外全卷积网络预测目标像素级位置
"""